---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.NumberedElementId
source: html/2baae2d1-c174-87d2-3949-32dffd42fdda.htm
---
# Autodesk.Revit.DB.NumberSystem.NumberedElementId Property

The LinkElementId of the numbered host element.

## Syntax (C#)
```csharp
public LinkElementId NumberedElementId { get; }
```